/*
http://www.iteye.com/topic/1134016
二维数组（N*N），沿对角线方向，从右上角打印到左下角如N=4： 
4*4二维数组 
{ 1 2 3 4 }  
{ 5 6 7 8 }  
{ 9 10 11 12 }  
{13 14 15 16 }  

打印顺序 
4  
3 8  
2 7 12  
1 6 11 16  
5 10 15  
9 14  
13  

要求半个小时内写出可完整运行的代码。*/

/*
  王昊在公司群里发的题，随便写了下，这是js实现，直接暴力遍历的
*/

var N = 4;
var arr = [[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12], [13, 14, 15, 16]];

for (var i = N - 1; i > -N; i--)
{
    var x = i >= 0 ? 0 : -i;
    var y = x == 0 ? i : 0;

    var lineStr = "";
    while(x < N && y < N)
    {
        lineStr += arr[x][y] + " ";
        x++;
        y++
    }
    console.log(lineStr);
}
